tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
# Search tool like grep, but optimized for programmers
brew "ack"
# Shell extension to jump to frequently used directories
brew "autojump"
# .NET Core
brew "dotnet"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# AVH edition of git-flow
brew "git-flow-avh"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Utility to create and modify archives
cask "betterzip"
# Test localhost and staging websites
cask "browserstacklocal"
# Clipboard extension app
cask "clipy"
# Visually compare and merge files
cask "diffmerge"
# App to build and share containerized applications and microservices
cask "docker"
# QuickLook generator and Spotlight importer
cask "epubquicklook"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Developer targeted fonts with a high number of glyphs
cask "font-code-new-roman-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-droid-sans-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-go-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-lgc-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-profont-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-roboto-mono-nerd-font"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-canary"
# Menu bar calendar
cask "itsycal"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# QuickLook generator for Markdown files
cask "qlmarkdown"
cask "qlprettypatch"
# QuickLook plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# QuickLook plugin for CSV files
cask "quicklook-csv"
# QuickLook plugin for JSON files
cask "quicklook-json"
cask "quicklook-pat"
# QuickLook generator for Adobe Swatch Exchange files
cask "quicklookase"
# Graphical client for Git version control
cask "sourcetree"
# Move and resize windows with ease
cask "rectangle"
# Music streaming service
cask "spotify"
# Quicklook extension for source files
cask "syntax-highlight"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Time tracker
cask "toggl-track"
# Open-source code editor
cask "visual-studio-code"
cask "webpquicklook"
